<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/11476197-b66b-4a51-9729-452f30d2ad57/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_prometheus_workspace.prometheus will be updated in-place
  ~ resource "aws_prometheus_workspace" "prometheus" {
      ~ alias               = "prometheus-prod-history" -> "prometheus-walletconnect-eu-central-1-prod-history"
        id                  = "ws-29641597-9b6a-44dd-9f05-e48a94e51f9c"
      ~ tags                = {
          - "Name" = "walletconnect-prod-history" -> null
        }
      ~ tags_all            = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.dns.aws_acm_certificate.domain_certificate will be updated in-place
  ~ resource "aws_acm_certificate" "domain_certificate" {
        id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/5030302f-c887-4743-909b-76e57f844a3c"
      ~ tags                      = {
          - "Name" = "walletconnect-prod-history" -> null
        }
      ~ tags_all                  = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_cloudwatch_log_group.cluster_logs must be replaced
-/+ resource "aws_cloudwatch_log_group" "cluster_logs" {
      ~ arn               = "arn:aws:logs:eu-central-1:898587786287:log-group:prod-history_logs" -> (known after apply)
      ~ id                = "prod-history_logs" -> (known after apply)
      ~ name              = "prod-history_logs" -> "walletconnect-prod-history_logs" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all          = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_cluster.app_cluster must be replaced
-/+ resource "aws_ecs_cluster" "app_cluster" {
      ~ arn                = "arn:aws:ecs:eu-central-1:898587786287:cluster/prod-history" -> (known after apply)
      ~ capacity_providers = [] -> (known after apply)
      ~ id                 = "arn:aws:ecs:eu-central-1:898587786287:cluster/prod-history" -> (known after apply)
      ~ name               = "prod-history" -> "walletconnect-prod-history" # forces replacement
      - tags               = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all           = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }

      ~ configuration {
          ~ execute_command_configuration {
                # (1 unchanged attribute hidden)

              ~ log_configuration {
                  ~ cloud_watch_log_group_name     = "prod-history_logs" -> "walletconnect-prod-history_logs"
                  - s3_bucket_encryption_enabled   = false -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # module.ecs.aws_ecs_service.app_service must be replaced
-/+ resource "aws_ecs_service" "app_service" {
      ~ cluster                            = "arn:aws:ecs:eu-central-1:898587786287:cluster/prod-history" # forces replacement -> (known after apply)
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod-history/prod-history-service" -> (known after apply)
      ~ name                               = "prod-history-service" -> "walletconnect-prod-history-service" # forces replacement
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all                           = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-history:6" -> (known after apply)
      ~ triggers                           = {} -> (known after apply)
        # (8 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "prod-history" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-history-target-group/0fe353425cec2903" -> null
        }
      + load_balancer {
          + container_name   = "walletconnect-prod-history"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-02e638a4cfdf08176",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-history:6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ execution_role_arn       = "arn:aws:iam::898587786287:role/prod-history-ecs-task-execution-role" # forces replacement -> (known after apply)
      ~ family                   = "prod-history" -> "walletconnect-prod-history" # forces replacement
      ~ id                       = "prod-history" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
      - tags                     = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all                 = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
      ~ task_role_arn            = "arn:aws:iam::898587786287:role/prod-history-ecs-task-execution-role" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_policy.otel must be replaced
-/+ resource "aws_iam_policy" "otel" {
      ~ arn       = "arn:aws:iam::898587786287:policy/prod-history-otel" -> (known after apply)
      ~ id        = "arn:aws:iam::898587786287:policy/prod-history-otel" -> (known after apply)
      ~ name      = "prod-history-otel" -> "walletconnect-prod-history-otel" # forces replacement
      ~ policy_id = "ANPA5COABPQX4RWYNEQZI" -> (known after apply)
      - tags      = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all  = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role must be replaced
-/+ resource "aws_iam_role" "ecs_task_execution_role" {
      ~ arn                   = "arn:aws:iam::898587786287:role/prod-history-ecs-task-execution-role" -> (known after apply)
      ~ create_date           = "2023-01-23T20:26:58Z" -> (known after apply)
      ~ id                    = "prod-history-ecs-task-execution-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::898587786287:policy/prod-history-otel",
          - "arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess",
          - "arn:aws:iam::aws:policy/AmazonPrometheusRemoteWriteAccess",
          - "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess",
          - "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess",
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> (known after apply)
      ~ name                  = "prod-history-ecs-task-execution-role" -> "walletconnect-prod-history-ecs-task-execution-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all              = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
      ~ unique_id             = "AROA5COABPQXXZNNIRCOV" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cloudwatch_write_policy" {
      ~ id         = "prod-history-ecs-task-execution-role-20230123202659478000000005" -> (known after apply)
      ~ role       = "prod-history-ecs-task-execution-role" -> "walletconnect-prod-history-ecs-task-execution-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_fetch_ghcr_secret_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_fetch_ghcr_secret_policy" {
      ~ id         = "prod-history-ecs-task-execution-role-20230123202659482300000006" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::898587786287:policy/prod-history-otel" # forces replacement -> (known after apply)
      ~ role       = "prod-history-ecs-task-execution-role" -> "walletconnect-prod-history-ecs-task-execution-role" # forces replacement
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      ~ id         = "prod-history-ecs-task-execution-role-20230123202659529400000007" -> (known after apply)
      ~ role       = "prod-history-ecs-task-execution-role" -> "walletconnect-prod-history-ecs-task-execution-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_xray_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_xray_policy" {
      ~ id         = "prod-history-ecs-task-execution-role-20230123202659467000000004" -> (known after apply)
      ~ role       = "prod-history-ecs-task-execution-role" -> "walletconnect-prod-history-ecs-task-execution-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "prometheus_write_policy" {
      ~ id         = "prod-history-ecs-task-execution-role-20230123202659446200000002" -> (known after apply)
      ~ role       = "prod-history-ecs-task-execution-role" -> "walletconnect-prod-history-ecs-task-execution-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.ssm_read_only_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ssm_read_only_policy" {
      ~ id         = "prod-history-ecs-task-execution-role-20230123202659453200000003" -> (known after apply)
      ~ role       = "prod-history-ecs-task-execution-role" -> "walletconnect-prod-history-ecs-task-execution-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_lb.application_load_balancer must be replaced
-/+ resource "aws_lb" "application_load_balancer" {
      ~ arn                              = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/prod-history-load-balancer/28b76ad29a3fee28" -> (known after apply)
      ~ arn_suffix                       = "app/prod-history-load-balancer/28b76ad29a3fee28" -> (known after apply)
      ~ dns_name                         = "prod-history-load-balancer-1312468822.eu-central-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing = true -> null
      ~ id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/prod-history-load-balancer/28b76ad29a3fee28" -> (known after apply)
      ~ internal                         = false -> (known after apply)
      ~ ip_address_type                  = "ipv4" -> (known after apply)
      ~ name                             = "prod-history-load-balancer" -> "walletconnect-prod-history" # forces replacement
      ~ security_groups                  = [
          - "sg-0e0eb53e20c292a5f",
        ] -> (known after apply)
      - tags                             = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all                         = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                           = "vpc-02b02d7ebf64d7699" -> (known after apply)
      ~ zone_id                          = "Z215JYRZR1TBD5" -> (known after apply)
        # (9 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-01ebbeab3a2cb9086" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-030e5c8360518bf8b" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-062389591aadc0473" -> null
        }
    }

  # module.ecs.aws_lb_listener.listener must be replaced
-/+ resource "aws_lb_listener" "listener" {
      ~ arn               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/prod-history-load-balancer/28b76ad29a3fee28/701716f63ad30744" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/prod-history-load-balancer/28b76ad29a3fee28/701716f63ad30744" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/prod-history-load-balancer/28b76ad29a3fee28" # forces replacement -> (known after apply)
      ~ ssl_policy        = "ELBSecurityPolicy-2016-08" -> (known after apply)
      - tags              = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all          = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-history-target-group/0fe353425cec2903" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_lb_listener.listener-http must be replaced
-/+ resource "aws_lb_listener" "listener-http" {
      ~ arn               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/prod-history-load-balancer/28b76ad29a3fee28/a48db675784c3024" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/prod-history-load-balancer/28b76ad29a3fee28/a48db675784c3024" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/prod-history-load-balancer/28b76ad29a3fee28" # forces replacement -> (known after apply)
      + ssl_policy        = (known after apply)
      - tags              = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all          = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order = 1 -> (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.ecs.aws_lb_target_group.target_group must be replaced
+/- resource "aws_lb_target_group" "target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-history-target-group/0fe353425cec2903" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/prod-history-target-group/0fe353425cec2903" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-history-target-group/0fe353425cec2903" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "prod-history-target-group" -> "walletconnect-prod-history" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all                           = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # module.ecs.aws_route53_record.dns_load_balancer will be updated in-place
  ~ resource "aws_route53_record" "dns_load_balancer" {
        id                               = "Z0286513H7OCKOILRQM6_history.walletconnect.com_A"
        name                             = "history.walletconnect.com"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "prod-history-load-balancer-1312468822.eu-central-1.elb.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z215JYRZR1TBD5" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_security_group.app_ingress must be replaced
+/- resource "aws_security_group" "app_ingress" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-02e638a4cfdf08176" -> (known after apply)
      ~ id                     = "sg-02e638a4cfdf08176" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0e0eb53e20c292a5f",
                ]
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
      ~ name                   = "prod-history-ingress-to-app" -> "walletconnect-prod-history-ingress-to-app" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all               = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.lb_ingress must be replaced
+/- resource "aws_security_group" "lb_ingress" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0e0eb53e20c292a5f" -> (known after apply)
      ~ id                     = "sg-0e0eb53e20c292a5f" -> (known after apply)
      ~ name                   = "prod-history-lb-ingress" -> "walletconnect-prod-history-lb-ingress" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      ~ tags_all               = {
          + "Environment" = "eu-central-1"
          ~ "Name"        = "walletconnect-prod-history" -> "walletconnect-eu-central-1-prod-history"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.history_docdb.aws_docdb_cluster.docdb_primary will be created
  + resource "aws_docdb_cluster" "docdb_primary" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 1
      + cluster_identifier              = "walletconnect-prod-history-history-db-primary"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "walletconnect-prod-history-history-db-private-subnet-group"
      + enabled_cloudwatch_logs_exports = [
          + "audit",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "gilgamesh"
      + port                            = 27017
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = true
      + tags_all                        = {
          + "Environment" = "eu-central-1"
          + "Name"        = "walletconnect-eu-central-1-prod-history"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + vpc_security_group_ids          = (known after apply)
    }

  # module.history_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_instances" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = (known after apply)
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + enable_performance_insights     = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "walletconnect-prod-history-history-db-primary-instance-0"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.xlarge"
      + kms_key_id                      = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = (known after apply)
      + storage_encrypted               = (known after apply)
      + tags_all                        = {
          + "Environment" = "eu-central-1"
          + "Name"        = "walletconnect-eu-central-1-prod-history"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + writer                          = (known after apply)
    }

  # module.history_docdb.aws_docdb_subnet_group.private_subnets will be created
  + resource "aws_docdb_subnet_group" "private_subnets" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "walletconnect-prod-history-history-db-private-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-05cf1c203c88fa386",
          + "subnet-09226556fd9b1b1a4",
          + "subnet-0b32e43f9f425feec",
        ]
      + tags_all    = {
          + "Environment" = "eu-central-1"
          + "Name"        = "walletconnect-eu-central-1-prod-history"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
    }

  # module.history_docdb.aws_kms_key.docdb_encryption will be created
  + resource "aws_kms_key" "docdb_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Environment" = "eu-central-1"
          + "Name"        = "walletconnect-eu-central-1-prod-history"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
    }

  # module.history_docdb.aws_secretsmanager_secret.master_password will be created
  + resource "aws_secretsmanager_secret" "master_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "walletconnect-prod-history-history-db-master-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Environment" = "eu-central-1"
          + "Name"        = "walletconnect-eu-central-1-prod-history"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
    }

  # module.history_docdb.aws_secretsmanager_secret_version.master_password will be created
  + resource "aws_secretsmanager_secret_version" "master_password" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.history_docdb.aws_security_group.service_security_group will be created
  + resource "aws_security_group" "service_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow ingress from the application"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow outbound traffic from the DocDB cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow inbound traffic to the DocDB cluster"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
      + name                   = "walletconnect-prod-history-history-db-service"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "eu-central-1"
          + "Name"        = "walletconnect-eu-central-1-prod-history"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + vpc_id                 = "vpc-02b02d7ebf64d7699"
    }

  # module.history_docdb.random_password.master_password will be created
  + resource "random_password" "master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.keystore-docdb.aws_docdb_cluster.docdb_primary will be destroyed
  # (because aws_docdb_cluster.docdb_primary is not in configuration)
  - resource "aws_docdb_cluster" "docdb_primary" {
      - arn                             = "arn:aws:rds:eu-central-1:898587786287:cluster:prod-history-keystore-docdb-primary-cluster" -> null
      - availability_zones              = [
          - "eu-central-1a",
          - "eu-central-1b",
          - "eu-central-1c",
        ] -> null
      - backup_retention_period         = 1 -> null
      - cluster_identifier              = "prod-history-keystore-docdb-primary-cluster" -> null
      - cluster_members                 = [
          - "prod-history-keystore-docdb-primary-instance-0",
        ] -> null
      - cluster_resource_id             = "cluster-36RGG7RF6SYXAINSG52YE2AC54" -> null
      - db_cluster_parameter_group_name = "default.docdb4.0" -> null
      - db_subnet_group_name            = "prod-history-keystore-docdb-private-subnet-group" -> null
      - deletion_protection             = false -> null
      - enabled_cloudwatch_logs_exports = [
          - "audit",
        ] -> null
      - endpoint                        = "prod-history-keystore-docdb-primary-cluster.cluster-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> null
      - engine                          = "docdb" -> null
      - engine_version                  = "4.0.0" -> null
      - hosted_zone_id                  = "Z1ZKU8ZZR6T7FW" -> null
      - id                              = "prod-history-keystore-docdb-primary-cluster" -> null
      - kms_key_id                      = "arn:aws:kms:eu-central-1:898587786287:key/142214cf-e18a-4a28-8c5e-f632417318e8" -> null
      - master_password                 = (sensitive value) -> null
      - master_username                 = "gilgamesh" -> null
      - port                            = 27017 -> null
      - preferred_backup_window         = "02:59-03:29" -> null
      - preferred_maintenance_window    = "fri:23:20-fri:23:50" -> null
      - reader_endpoint                 = "prod-history-keystore-docdb-primary-cluster.cluster-ro-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> null
      - skip_final_snapshot             = true -> null
      - storage_encrypted               = true -> null
      - tags                            = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      - tags_all                        = {
          - "Name"      = "walletconnect-prod-history"
          - "Namespace" = "walletconnect"
          - "Stage"     = "prod"
        } -> null
      - vpc_security_group_ids          = [
          - "sg-005c1cb42e2f12bef",
        ] -> null
    }

  # module.keystore-docdb.aws_docdb_cluster_instance.docdb_instances[0] will be destroyed
  # (because aws_docdb_cluster_instance.docdb_instances is not in configuration)
  - resource "aws_docdb_cluster_instance" "docdb_instances" {
      - arn                          = "arn:aws:rds:eu-central-1:898587786287:db:prod-history-keystore-docdb-primary-instance-0" -> null
      - auto_minor_version_upgrade   = true -> null
      - availability_zone            = "eu-central-1b" -> null
      - ca_cert_identifier           = "rds-ca-2019" -> null
      - cluster_identifier           = "prod-history-keystore-docdb-primary-cluster" -> null
      - db_subnet_group_name         = "prod-history-keystore-docdb-private-subnet-group" -> null
      - dbi_resource_id              = "db-CTGVGACL664L3ZZ7SSFAV44EMU" -> null
      - endpoint                     = "prod-history-keystore-docdb-primary-instance-0.cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> null
      - engine                       = "docdb" -> null
      - engine_version               = "4.0.0" -> null
      - id                           = "prod-history-keystore-docdb-primary-instance-0" -> null
      - identifier                   = "prod-history-keystore-docdb-primary-instance-0" -> null
      - instance_class               = "db.r5.xlarge" -> null
      - kms_key_id                   = "arn:aws:kms:eu-central-1:898587786287:key/142214cf-e18a-4a28-8c5e-f632417318e8" -> null
      - port                         = 27017 -> null
      - preferred_backup_window      = "02:59-03:29" -> null
      - preferred_maintenance_window = "tue:22:36-tue:23:06" -> null
      - promotion_tier               = 0 -> null
      - publicly_accessible          = false -> null
      - storage_encrypted            = true -> null
      - tags                         = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      - tags_all                     = {
          - "Name"      = "walletconnect-prod-history"
          - "Namespace" = "walletconnect"
          - "Stage"     = "prod"
        } -> null
      - writer                       = true -> null
    }

  # module.keystore-docdb.aws_docdb_subnet_group.private_subnets will be destroyed
  # (because aws_docdb_subnet_group.private_subnets is not in configuration)
  - resource "aws_docdb_subnet_group" "private_subnets" {
      - arn         = "arn:aws:rds:eu-central-1:898587786287:subgrp:prod-history-keystore-docdb-private-subnet-group" -> null
      - description = "Managed by Terraform" -> null
      - id          = "prod-history-keystore-docdb-private-subnet-group" -> null
      - name        = "prod-history-keystore-docdb-private-subnet-group" -> null
      - subnet_ids  = [
          - "subnet-05cf1c203c88fa386",
          - "subnet-09226556fd9b1b1a4",
          - "subnet-0b32e43f9f425feec",
        ] -> null
      - tags        = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      - tags_all    = {
          - "Name"      = "walletconnect-prod-history"
          - "Namespace" = "walletconnect"
          - "Stage"     = "prod"
        } -> null
    }

  # module.keystore-docdb.aws_kms_key.docdb_encryption will be destroyed
  # (because aws_kms_key.docdb_encryption is not in configuration)
  - resource "aws_kms_key" "docdb_encryption" {
      - arn                                = "arn:aws:kms:eu-central-1:898587786287:key/142214cf-e18a-4a28-8c5e-f632417318e8" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "142214cf-e18a-4a28-8c5e-f632417318e8" -> null
      - is_enabled                         = true -> null
      - key_id                             = "142214cf-e18a-4a28-8c5e-f632417318e8" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Id        = "key-default-1"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::898587786287:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                               = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      - tags_all                           = {
          - "Name"      = "walletconnect-prod-history"
          - "Namespace" = "walletconnect"
          - "Stage"     = "prod"
        } -> null
    }

  # module.keystore-docdb.aws_secretsmanager_secret.master_password will be destroyed
  # (because aws_secretsmanager_secret.master_password is not in configuration)
  - resource "aws_secretsmanager_secret" "master_password" {
      - arn                            = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-history-keystore-docdb-master-password-Nwhl8n" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-history-keystore-docdb-master-password-Nwhl8n" -> null
      - name                           = "prod-history-keystore-docdb-master-password" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      - tags_all                       = {
          - "Name"      = "walletconnect-prod-history"
          - "Namespace" = "walletconnect"
          - "Stage"     = "prod"
        } -> null
    }

  # module.keystore-docdb.aws_secretsmanager_secret_version.master_password will be destroyed
  # (because aws_secretsmanager_secret_version.master_password is not in configuration)
  - resource "aws_secretsmanager_secret_version" "master_password" {
      - arn            = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-history-keystore-docdb-master-password-Nwhl8n" -> null
      - id             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-history-keystore-docdb-master-password-Nwhl8n|214D11D1-694B-48F7-A036-EE26F6978002" -> null
      - secret_id      = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-history-keystore-docdb-master-password-Nwhl8n" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "214D11D1-694B-48F7-A036-EE26F6978002" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.keystore-docdb.aws_security_group.service_security_group will be destroyed
  # (because aws_security_group.service_security_group is not in configuration)
  - resource "aws_security_group" "service_security_group" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-005c1cb42e2f12bef" -> null
      - description            = "Allow ingress from the application" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Allow outbound traffic from the DocDB cluster"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-005c1cb42e2f12bef" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Allow inbound traffic to the DocDB cluster"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
            },
        ] -> null
      - name                   = "prod-history-keystore-docdb-service" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "walletconnect-prod-history"
        } -> null
      - tags_all               = {
          - "Name"      = "walletconnect-prod-history"
          - "Namespace" = "walletconnect"
          - "Stage"     = "prod"
        } -> null
      - vpc_id                 = "vpc-02b02d7ebf64d7699" -> null

      - timeouts {}
    }

  # module.keystore-docdb.random_password.master_password will be destroyed
  # (because random_password.master_password is not in configuration)
  - resource "random_password" "master_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.o11y.grafana_dashboard.at_a_glance will be updated in-place
  ~ resource "grafana_dashboard" "at_a_glance" {
      ~ config_json  = jsonencode(
          ~ {
              ~ panels               = [
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "uL5HCbTVz"
                        }
                      + description   = "The number of items received from relay"
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                    ]
                                }
                            }
                          + overrides = []
                        }
                      + gridPos       = {
                          + h = 8
                          + w = 10
                          + x = 0
                          + y = 0
                        }
                      + options       = {
                          + colorMode     = "value"
                          + graphMode     = "area"
                          + justifyMode   = "auto"
                          + orientation   = "auto"
                          + reduceOptions = {
                              + calcs  = [
                                  + "lastNotNull",
                                ]
                              + fields = ""
                              + values = false
                            }
                          + text          = {}
                          + textMode      = "auto"
                        }
                      + pluginVersion = "8.4.7"
                      + targets       = [
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "uL5HCbTVz"
                                }
                              + exemplar     = true
                              + expr         = "sum(rate(received_items{}[1h]))"
                              + interval     = ""
                              + legendFormat = ""
                              + refId        = "A"
                            },
                        ]
                      + title         = "Received Items per Hour"
                      + type          = "stat"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "uL5HCbTVz"
                        }
                      + description   = "The number of items actually stored in the database"
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                    ]
                                }
                            }
                          + overrides = []
                        }
                      + gridPos       = {
                          + h = 8
                          + w = 10
                          + x = 10
                          + y = 0
                        }
                      + options       = {
                          + colorMode     = "value"
                          + graphMode     = "area"
                          + justifyMode   = "auto"
                          + orientation   = "auto"
                          + reduceOptions = {
                              + calcs  = [
                                  + "lastNotNull",
                                ]
                              + fields = ""
                              + values = false
                            }
                          + text          = {}
                          + textMode      = "auto"
                        }
                      + pluginVersion = "8.4.7"
                      + targets       = [
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "uL5HCbTVz"
                                }
                              + exemplar     = true
                              + expr         = "sum(rate(stored_items{}[1h]))"
                              + interval     = ""
                              + legendFormat = ""
                              + refId        = "A"
                            },
                        ]
                      + title         = "Stored Items per Hour"
                      + type          = "stat"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "uL5HCbTVz"
                        }
                      + description   = "The number of items retrieval queries"
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                    ]
                                }
                            }
                          + overrides = []
                        }
                      + gridPos       = {
                          + h = 8
                          + w = 10
                          + x = 0
                          + y = 8
                        }
                      + options       = {
                          + colorMode     = "value"
                          + graphMode     = "area"
                          + justifyMode   = "auto"
                          + orientation   = "auto"
                          + reduceOptions = {
                              + calcs  = [
                                  + "lastNotNull",
                                ]
                              + fields = ""
                              + values = false
                            }
                          + text          = {}
                          + textMode      = "auto"
                        }
                      + pluginVersion = "8.4.7"
                      + targets       = [
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "uL5HCbTVz"
                                }
                              + exemplar     = true
                              + expr         = "sum(rate(get_queries{}[1h]))"
                              + interval     = ""
                              + legendFormat = ""
                              + refId        = "A"
                            },
                        ]
                      + title         = "Get Queries per Hour"
                      + type          = "stat"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "uL5HCbTVz"
                        }
                      + description   = "The number of messages served to clients"
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                    ]
                                }
                            }
                          + overrides = []
                        }
                      + gridPos       = {
                          + h = 8
                          + w = 10
                          + x = 10
                          + y = 8
                        }
                      + options       = {
                          + colorMode     = "value"
                          + graphMode     = "area"
                          + justifyMode   = "auto"
                          + orientation   = "auto"
                          + reduceOptions = {
                              + calcs  = [
                                  + "lastNotNull",
                                ]
                              + fields = ""
                              + values = false
                            }
                          + text          = {}
                          + textMode      = "auto"
                        }
                      + pluginVersion = "8.4.7"
                      + targets       = [
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "uL5HCbTVz"
                                }
                              + exemplar     = true
                              + expr         = "sum(rate(served_items{}[1h]))"
                              + interval     = ""
                              + legendFormat = ""
                              + refId        = "A"
                            },
                        ]
                      + title         = "Served Items per Hour"
                      + type          = "stat"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "uL5HCbTVz"
                        }
                      + description   = "The number of registrations retrieved from the in-memory cache"
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                    ]
                                }
                            }
                          + overrides = []
                        }
                      + gridPos       = {
                          + h = 16
                          + w = 10
                          + x = 0
                          + y = 8
                        }
                      + options       = {
                          + colorMode     = "value"
                          + graphMode     = "area"
                          + justifyMode   = "auto"
                          + orientation   = "auto"
                          + reduceOptions = {
                              + calcs  = [
                                  + "lastNotNull",
                                ]
                              + fields = ""
                              + values = false
                            }
                          + text          = {}
                          + textMode      = "auto"
                        }
                      + pluginVersion = "8.4.7"
                      + targets       = [
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "uL5HCbTVz"
                                }
                              + exemplar     = true
                              + expr         = "sum(rate(cached_registrations{}[1h]))"
                              + interval     = ""
                              + legendFormat = ""
                              + refId        = "A"
                            },
                        ]
                      + title         = "Cached Registrations per Hour"
                      + type          = "stat"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "uL5HCbTVz"
                        }
                      + description   = "The number of registrations retrieved from the database"
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                    ]
                                }
                            }
                          + overrides = []
                        }
                      + gridPos       = {
                          + h = 16
                          + w = 10
                          + x = 10
                          + y = 8
                        }
                      + options       = {
                          + colorMode     = "value"
                          + graphMode     = "area"
                          + justifyMode   = "auto"
                          + orientation   = "auto"
                          + reduceOptions = {
                              + calcs  = [
                                  + "lastNotNull",
                                ]
                              + fields = ""
                              + values = false
                            }
                          + text          = {}
                          + textMode      = "auto"
                        }
                      + pluginVersion = "8.4.7"
                      + targets       = [
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "uL5HCbTVz"
                                }
                              + exemplar     = true
                              + expr         = "sum(rate(fetched_registrations{}[1h]))"
                              + interval     = ""
                              + legendFormat = ""
                              + refId        = "A"
                            },
                        ]
                      + title         = "Fetched Registrations Items per Hour"
                      + type          = "stat"
                    },
                ]
              ~ schemaVersion        = 36 -> 1
                tags                 = []
              ~ title                = "prod_history" -> "walletconnect-prod-prod-history"
              ~ uid                  = "prod_history" -> "walletconnect-prod-prod-history"
                # (12 unchanged attributes hidden)
            }
        )
        id           = "0:prod_history"
        # (7 unchanged attributes hidden)
    }

  # module.o11y.grafana_data_source.cloudwatch will be updated in-place
  ~ resource "grafana_data_source" "cloudwatch" {
        id                 = "81"
      ~ json_data_encoded  = jsonencode(
          ~ {
              ~ defaultRegion = "eu-central-1" -> "prod"
            }
        )
      ~ name               = "prod-history-cloudwatch" -> "walletconnect-prod-prod-history-cloudwatch"
        # (5 unchanged attributes hidden)
    }

  # module.o11y.grafana_data_source.prometheus will be updated in-place
  ~ resource "grafana_data_source" "prometheus" {
        id                 = "82"
      ~ json_data_encoded  = jsonencode(
          ~ {
              ~ sigV4Region   = "eu-central-1" -> "prod"
                # (4 unchanged attributes hidden)
            }
        )
      ~ name               = "prod-history-amp" -> "walletconnect-prod-prod-history-amp"
      ~ url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/" -> "https://aps-workspaces.prod.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/"
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0e4c3e984dd851e98"
        tags                 = {
            "Name" = "prod-history-eu-central-1a"
        }
      ~ tags_all             = {
          + "Environment" = "eu-central-1"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-092684c3f9ff22731"
        tags     = {
            "Name" = "prod-history"
        }
      ~ tags_all = {
          + "Environment" = "eu-central-1"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-013632d6acdc19f3c"
        tags                 = {
            "Name" = "prod-history-eu-central-1a"
        }
      ~ tags_all             = {
          + "Environment" = "eu-central-1"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-009d6aead2afe5310"
        tags             = {
            "Name" = "prod-history-private"
        }
      ~ tags_all         = {
          + "Environment" = "eu-central-1"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-018f623a7e829f2b4"
        tags             = {
            "Name" = "prod-history-public"
        }
      ~ tags_all         = {
          + "Environment" = "eu-central-1"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-05cf1c203c88fa386"
        tags                                           = {
            "Name"       =
...

```

</details>

*Action: `pull_request`*